Repository: MylanBeghin/StroopApp
Catalog: StroopApp/Resources/Strings.*.resx
Languages: fr

# Button_LaunchExperiment
source: Start Experiment
fr: Lancer l'expérience

# Error_SelectProfile
source: Please select an experiment profile.
fr: Veuillez sélectionner un profil d'expérience.

# Error_SelectParticipant
source: Please select a participant.
fr: Veuillez sélectionner un participant.

# Error_SelectProfileToModify
source: Please select a profile to modify!
fr: Veuillez sélectionner un profil à modifier !

# Error_SelectProfileToDelete
source: Please select a profile to delete !
fr: Veuillez sélectionner un profil à supprimer !

# Error_ProfileNameEmpty
source: Profile name cannot be empty or whitespace.
fr: Le nom du profil ne peut pas être vide ou contenir uniquement des espaces.

# Error_ProfileNameExists
source: A profile with this name already exists. Choose another name.
fr: Un profil avec ce nom existe déjà. Veuillez choisir un autre nom.

# Error_WordDurationInvalid
source: Trial duration must be positive and divide task duration.
fr: La durée de l'essai doit être positive et la durée totale doit être divisible par la durée de la tâche.

# Error_GroupSizeInvalid
source: The averaging interval must be positive and divide the number of trials.
fr: La taille du groupe doit être positive et diviser le nombre d'essais.

# Error_SelectParticipantToModify
source: Please select a participant to modify!
fr: Veuillez sélectionner un participant à modifier !

# Error_SelectParticipantToDelete
source: Please select a participant to delete !
fr: Veuillez sélectionner un participant à supprimer !

# Error_DuplicateParticipantId
source: This identifier is already used for another participant.
fr: Cet identifiant est déjà utilisé pour un autre participant.

# Error_NoExportFolder
source: No export folder configured.
fr: Aucun dossier d'export configuré.

# Error_Title
source: Error
fr: Erreur

# Menu_Display
source: Display
fr: Affichage

# Menu_Languages
source: Languages
fr: Langues

# Button_Browse
source: Browse
fr: Parcourir

# Button_Create
source: Create
fr: Créer

# Button_Delete
source: Delete
fr: Supprimer

# Field_Age
source: Age
fr: Âge

# Field_Weight
source: Weight (kg)
fr: Poids (kg)

# Field_Height
source: Height (cm)
fr: Taille (cm)

# Field_Sex
source: Sex
fr: Sexe

# Field_Gender
source: Gender
fr: Genre

# Button_Cancel
source: Cancel
fr: Annuler

# Button_Save
source: Save
fr: Enregistrer

# Tooltip_Congruence
source: Defines the proportion of congruent trials in the block. A trial is congruent when its meaning matches its color (e.g. the word Red written in red). Example: 25% = 75% incongruent, 25% congruent.
fr: Définit la proportion d'essais congruents dans le bloc. Un essai est congruent lorsque sa signification correspond à sa couleur (ex. le mot Rouge écrit en rouge). Exemple : 25 % = 75 % d’incongruents, 25 % de congruents.

# Tooltip_Switch
source: Defines how often the visual cue changes between two trials. A switch is a transition from square to circle or vice versa. Example: 100% = alternation each trial, 0% = always the same shape.
fr: Définit la fréquence de changement de forme d’indice visuel entre deux essais. Un switch correspond à un passage d’un carré à un rond, ou inversement. Exemple : 100 % = alternance à chaque essai, 0 % = toujours la même forme.

# Header_Hours
source: Hours
fr: Heures

# Header_Seconds
source: Seconds
fr: Secondes

# Header_WordDuration
source: Trial duration (ms)
fr: Durée par essai (ms)

# Field_ProfileName
source: Profile name
fr: Nom du profil

# Label_CalculationMode
source: Calculation mode
fr: Mode de calcul

# Radio_TaskDuration
source: Based on task duration
fr: En fonction de la durée de la tâche

# Radio_WordCount
source: Based on trial count
fr: En fonction du nombre d'essai

# Field_WordCount
source: Trials count
fr: Nombre d'essais

# Label_KeyRed
source: Key associated with the red color:
fr: Touche associée à la couleur rouge :

# Label_KeyBlue
source: Key associated with the blue color:
fr: Touche associée à la couleur bleue :

# Label_KeyGreen
source: Key associated with the green color:
fr: Touche associée à la couleur verte :

# Label_KeyYellow
source: Key associated with the yellow color:
fr: Touche associée à la couleur jaune :

# Button_Edit
source: Edit
fr: Modifier

# Button_Continue
source: Continue with the same participant
fr: Relancer

# Button_NewExperiment
source: New experiment
fr: Nouvelle expérience

# Button_Quit
source: Quit application
fr: Quitter l'application

# Header_TrialDuration
source: Trial duration (ms)
fr: Durée de l'essai (ms)

# Header_ParticipantId
source: Participant ID
fr: ID du participant

# Header_Trials
source: Trials
fr: Essais

# Header_Accuracy
source: Accuracy
fr: Précision

# Toggle_On
source: On
fr: Activé

# Toggle_Off
source: Off
fr: Désactivé

# Header_FixationDuration
source: Fixation duration (ms)
fr: Durée de la croix de fixation (ms)

# Title_ExperimentWindow
source: Stroop Experiment
fr: Expérience Stroop

# Title_ParticipantWindow
source: Participant Window
fr: Fenêtre Participant

# Header_PrimeDuration
source: Visual cue duration (ms)
fr: Durée d'indice visuel (ms)

# Title_ConfigPage
source: Experiment Configuration
fr: Configuration de l'expérience

# Error_AmorceDurationInvalid
source: Visual cue duration must be greater than 0 !
fr: La durée d'affichage de l'indice visuel doit être supérieure à 0 !

# Error_MaxResponseTimeInvalid
source: Maximum response time must be positive.
fr: Le temps de réposnemaximum doit être positif.

# Title_Export_Completed
source: Export completed
fr: Export terminé

# Message_Export_Completed
source: File saved: {0}
fr: Fichier sauvegardé : {0}

# Label_LiveAverage
source: Average for trials {0}–{1}:
fr: Moyenne pour les essais {0}-{1}

# Label_LiveAverageNoData
source: No valid data
fr: Aucune donnée valide

# Label_NoResponse
source: No response
fr: Aucune réponse

# Title_DeleteConfirmation
source: Delete confirmation
fr: Confirmation de suppression

# Message_DeleteParticipantConfirmation
source: Do you really want to delete this participant? Their data will be archived.
fr: Voulez-vous vraiment supprimer ce participant ? Ses données seront archivées.

# Title_ExportFolderSelector
source: Results folder
fr: Choix du dossier des résultats

# Description_ExportFolderSelector
source: Select the export folder for the results.
fr: Sélectionnez le dossier d'exportation des résultats.

# Label_ExportFolderSelector_PathLabel
source: Results folder:
fr: Dossier des résultats :

# Title_ParticipantManagement
source: Participant
fr: Choix du participant

# Description_ParticipantManagement
source: Select a participant to start the experiment.
fr: Sélectionnez un participant pour lancer l'expérience.

# Title_ParticipantEditorWindow
source: Edit participant
fr: Modification du participant

# Title_ProfileManagement
source: Experiment profile
fr: Choix du profil de l'expérience

# Description_ProfileManagement
source: Select the profile to configure your experiment.
fr: Sélectionnez le profil à utiliser pour configurer votre expérience.

# Title_ProfileManagementDetails
source: Selected profile details
fr: Détails du profil sélectionné

# Title_ProfileEditorWindow
source: Edit profile
fr: Modification du profil

# Label_AddPrime
source: Add visual cue
fr: Ajouter un indice visuel

# Title_KeyMapping
source: Key mappings
fr: Choix des touches

# Description_KeyMapping
source: Select the keys associated with the colors.
fr: Sélectionnez les touches à associer aux couleurs.

# Title_KeyMappingDialog
source: Edit mapping for {0}
fr: Modification du mapping pour {0}

# Description_ExportFolderDialog
source: Select the export folder for your results
fr: Sélectionner le dossier d’exportation pour vos résultats

# Title_Dashboard
source: Experiment dashboard
fr: Tableau de bord de l'expérience

# Title_Progress
source: Progress
fr: Avancement

# Title_ParticipantDetails
source: Participant information
fr: Détails du participant

# Title_ExperimentDetails
source: Experiment details
fr: Détails de l'expérience

# Label_EndExperiment_BlockFinished
source: Block completed
fr: Bloc terminé

# Label_EndExperiment_BlockSummary
source: Block summary
fr: Résumé des blocs

# Title_EndInstructions
source: End of experiment
fr: Fin de l'expérience

# Message_EndInstructions
source: Congratulations! You have completed the experiment.
fr: Félicitations ! Vous avez terminé l'expérience.

# Title_GraphsView
source: Experiment tracking
fr: Suivi de l'expérience

# Error_ParticipantIdAlreadyUsed
source: This identifier is already in use for another participant.
fr: Cet identifiant est déjà utilisé pour un autre participant

# Message_DeleteProfileConfirmation
source: Do you really want to delete this profile?
fr: Voulez-vous vraiment supprimer ce profil ?

# Label_Disconnected
source: Disconnected
fr: Déconnecté

# Button_Connect
source: Connect
fr: Se connecter

# Error_NoPortSelected
source: No port selected.
fr: Aucun port sélectionné.

# Error_ConnectionError
source: Error during connection: {0}
fr: Erreur lors de la connexion : {0}

# Button_Disconnect
source: Disconnect
fr: Se déconnecter

# Label_PortConnected
source: Connected to {0}
fr: Connecté à {0}

# Error_DisconnectionError
source: Error during disconnection: {0}
fr: Erreur lors de la déconnexion : {0}

# Message_KeyMapping
source: Press a key to define the mapping. Press Esc to cancel.
fr: Appuyez sur une touche pour définir le mapping. Appuyez sur Échap pour annuler.

# Error_KeyMappingKeyUsed
source: This key is already used. Please choose another one.
fr: Cette touche est déjà utilisée. Veuillez choisir une autre touche.

# Label_TrialNumber
source: Trial: {0}
fr: Essai : {0}

# Label_ResponseTime
source: Response time: {0:N0} ms
fr: Temps de réponse : {0:N0} ms

# Label_ResponseValidityUnknown
source: Validity unknown
fr: Validité inconnue

# Header_ResponseTime
source: Response time (ms)
fr: Temps de réponse (ms)

# Label_CurrentParticipant
source: Participant ID : {0}
fr: Participant n° {0}

# Label_CurrentProfile
source: Task: {0}
fr: Tâche : {0}

# Label_SquarePercentage
source: Square (%)
fr: Carré (%)

# Label_CirclePercentage
source: Circle (%)
fr: Rond (%)

# Label_Overview
source: Overview :
fr: Aperçu :

# Header_SerialPorts
source: Serial ports
fr: Ports série

# Label_SerialPortsList
source: List of ports
fr: Liste des ports

# Button_Refresh
source: Refresh
fr: Rafraîchir

# Label_ExchangeHistory
source: Exchange history
fr: Historique des échanges

# Button_Copy
source: Copy
fr: Copier

# Button_Clear
source: Clear
fr: Effacer

# Button_Send
source: Send
fr: Envoyer

# Button_AdvancedSettings
source: Advanced settings
fr: Paramètres avancés

# Label_Parity
source: Parity
fr: Parité

# Column_NoResponse
source: No response
fr: Aucune réponse

# Button_Modify
source: Edit
fr: Modifier

# Check_AddPrime
source: Add visual cue
fr: Ajouter indice visuel

# Button_Quit_Without_Export
source: Quit application without export
fr: Quitter l'application sans exporter

# Error_FillIdField
source: Please fill at least the ID field
fr: Remplissez au moins le champ ID

# Header_MaxResponseTime
source: Max response time (ms)
fr: Temps de réponse max (ms)

# Header_MeanResponseTime
source: Average response time
fr: Temps moyen de réponse

# Placeholder_Search
source: Search
fr: Rechercher

# Button_Export
source: Export
fr: Exporter

# Label_PublicationPrefix
source: For associated publication with this rule, see Mangin et al.,
fr: Pour des publications associées à cette règle, voir Mangin et al.,

# Tooltip_CueSquareResponse
source: When the visual cue is a square, respond by reading the word.
fr: Lorsque l’indice visuel est un carré, répondez en lisant le mot.

# Tooltip_CueCircleResponse
source: When the visual cue is a circle, respond by naming the color of the word.
fr: Lorsque l’indice visuel est un cercle, répondez en indiquant la couleur du mot.

# Description_PreviewIntroduction
source: To illustrate your parameters, a dynamic preview of the sequence of visual cues updates in real time based on your settings.
fr: Pour expliciter vos paramètres, un aperçu dynamique de la séquence des indices visuels se met à jour en temps réel en fonction de vos réglages.
